package com.lcvc.tsg.dao.AdminDao;

import com.lcvc.tsg.model.Admin;
import com.lcvc.tsg.model.Book;
import com.lcvc.tsg.model.Book_Type;
import com.lcvc.tsg.model.Customer;

import java.util.List;

/**
 * @Author Anle
 * @Date 下午 3:25 2018/10/3 0003
 **/
public interface AdminDao {
    /*
     * @Author Anle
     * @Date 下午 3:27 2018/10/3 0003
     **/
    //******************************************************************客户的Dao语句************************************************************************
    //=============================== 查看客户（分页）==========================
    List<Customer> CustomerShow(int index);//展示所有用户

    /**
     * @Author Anle
     * @Date 下午 12:05 2018/10/5 0005
     **/
    //--=============================== 查看客户总数============================
    int CustomerCount();

    /**
     * @Author Anle
     * @Date 下午 2:05 2018/10/5 0005
     **/
    // <!--=============================== 查看客户详情=========================
    Customer getCustomer(int Customer_id);

    //******************************************************************书的Dao语句************************************************************************

    /**
     * @Author Anle
     * @Date 下午 4:23 2018/10/6 0006
     **/
    //=============================== 搜索书 ==================================
    List<Book> SearchBook(String searchs);

    /**
    * @Author Anle
    * @Date 下午 1:35 2018/10/7 0007
    **/
    //=============================== 展示书（分页） ==================================
    List<Book> BookShow(int index);
    /**
     * @Author Anle
     * @Date  2018/10/7 0007
     **/
    //=============================== 查看书的总数用于分页 ==============================
    int BookCount();

    //******************************************************************书类型的Dao语句*********************************************************************

    /**
     * @Author Anle
     * @Date 下午 12:59 2018/10/7 0007
     **/
    //=============================== 获取书的类型=============================
    Book_Type getBook_Type(int id);
    
    //******************************************************************管理员的Dao语句*********************************************************************
    /**
     * @Author Anle
     * @Date 下午 5:34 2018/10/7 0007
     **/
    //=============================== 查看管理员详情=============================

    Admin getAdmin(int id);

}
